Revit 2024 API
BuiltInFailures.CopyPasteFailures.CopingColumnBeamFailure Property
 The support order for a beam/column connection has been changed. When a beam is supported by a column that same beam cannot be coped by the column. The existing coping has been removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CopingColumnBeamFailure { get; }
Visual Basic
Public Shared ReadOnly Property CopingColumnBeamFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CopingColumnBeamFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace